#### Terraform Plan: ✅
<details>
<summary>Show</summary>
```terraform
[command]/home/runner/work/_temp/be078397-f466-427c-9fde-8e7ac99450de/terraform-bin plan -input=false
data.aws_caller_identity.current: Reading...
module.network.data.aws_security_group.web: Reading...
data.aws_alb.main: Reading...
module.network.data.aws_security_group.data: Reading...
data.aws_security_group.web: Reading...
module.network.data.aws_security_group.app: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
module.network.data.aws_vpc.main: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]
data.aws_caller_identity.current: Read complete after 0s [id=813318847992]
data.aws_security_group.web: Read complete after 1s [id=sg-077ca2fe1ed399078]
module.network.data.aws_security_group.data: Read complete after 1s [id=sg-068812412c1f4bea9]
module.network.data.aws_security_group.web: Read complete after 1s [id=sg-077ca2fe1ed399078]
module.network.data.aws_security_group.app: Read complete after 1s [id=sg-03895fdd9a15adf6e]
data.aws_alb.main: Read complete after 1s [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/1551ae1e56885489]
data.aws_alb_listener.front_end: Reading...
data.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd]
module.network.data.aws_vpc.main: Read complete after 1s [id=vpc-018906cab60cf165b]
module.network.data.aws_subnets.data: Reading...
module.network.data.aws_subnets.web: Reading...
module.network.data.aws_subnets.app: Reading...
module.network.data.aws_subnets.app: Read complete after 0s [id=ca-central-1]
module.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Reading...
module.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Reading...
module.network.data.aws_subnets.web: Read complete after 0s [id=ca-central-1]
module.network.data.aws_subnets.data: Read complete after 0s [id=ca-central-1]
module.network.data.aws_subnet.web["subnet-089c577af80110363"]: Reading...
module.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Reading...
module.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Reading...
module.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Reading...
module.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Read complete after 0s [id=subnet-0896ff158c3ecdc53]
module.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Read complete after 0s [id=subnet-048e25be105ae01d3]
module.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Read complete after 0s [id=subnet-0a663db91e3d61619]
module.network.data.aws_subnet.web["subnet-089c577af80110363"]: Read complete after 0s [id=subnet-089c577af80110363]
module.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Read complete after 0s [id=subnet-0077fd92d83bfff33]
module.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Read complete after 0s [id=subnet-0d0e52f2aabe9cd5d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_target_group.app will be created
  + resource "aws_alb_target_group" "app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "sample-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Application" = "Startup Sample"
        }
      + tags_all                           = {
          + "Application" = "Startup Sample"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-018906cab60cf165b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 5
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_appautoscaling_policy.down[0] will be created
  + resource "aws_appautoscaling_policy" "down" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "sample_scale_down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/sample-cluster/sample-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.up[0] will be created
  + resource "aws_appautoscaling_policy" "up" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "sample_scale_up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/sample-cluster/sample-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # aws_appautoscaling_target.target[0] will be created
  + resource "aws_appautoscaling_target" "target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 6
      + min_capacity       = 1
      + resource_id        = "service/sample-cluster/sample-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # aws_budgets_budget.cost will be created
  + resource "aws_budgets_budget" "cost" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + cost_filters      = (known after apply)
      + id                = (known after apply)
      + limit_amount      = "100.0"
      + limit_unit        = "USD"
      + name              = "startup-sample-monthly"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "TagKeyValue"
          + values = [
              + "user:Project$Startup Sample",
            ]
        }

      + cost_types {
          + include_credit             = (known after apply)
          + include_discount           = (known after apply)
          + include_other_subscription = (known after apply)
          + include_recurring          = (known after apply)
          + include_refund             = (known after apply)
          + include_subscription       = (known after apply)
          + include_support            = (known after apply)
          + include_tax                = (known after apply)
          + include_upfront            = (known after apply)
          + use_amortized              = (known after apply)
          + use_blended                = (known after apply)
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "FORECASTED"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 75
          + threshold_type             = "PERCENTAGE"
        }
    }

  # aws_cloudfront_distribution.geofencing[0] will be created
  + resource "aws_cloudfront_distribution" "geofencing" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "geofencing"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Application" = "Startup Sample"
        }
      + tags_all                       = {
          + "Application" = "Startup Sample"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + path_pattern           = "/static/*"
          + target_origin_id       = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Origin",
                ]
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "startup-sample-project.tnfhhm-dev.nimbus.cloud.gov.bc.ca"
          + origin_id           = (known after apply)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "CA",
                ]
              + restriction_type = "whitelist"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudwatch_metric_alarm.service_cpu_high[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "sample_cpu_utilization_high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "sample-cluster"
          + "ServiceName" = "sample-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "Application" = "Startup Sample"
        }
      + tags_all                              = {
          + "Application" = "Startup Sample"
        }
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.service_cpu_low[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "sample_cpu_utilization_low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "sample-cluster"
          + "ServiceName" = "sample-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "Application" = "Startup Sample"
        }
      + tags_all                              = {
          + "Application" = "Startup Sample"
        }
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_dynamodb_table.startup_sample_table will be created
  + resource "aws_dynamodb_table" "startup_sample_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "pid"
      + id               = (known after apply)
      + name             = "ssp-greetings"
      + range_key        = "createdAt"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Application" = "Startup Sample"
        }
      + tags_all         = {
          + "Application" = "Startup Sample"
        }
      + write_capacity   = 1

      + attribute {
          + name = "createdAt"
          + type = "S"
        }
      + attribute {
          + name = "pid"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "sample-cluster"
      + tags               = {
          + "Application" = "Startup Sample"
        }
      + tags_all           = {
          + "Application" = "Startup Sample"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_cluster_capacity_providers.sample will be created
  + resource "aws_ecs_cluster_capacity_providers" "sample" {
      + capacity_providers = [
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "sample-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }
    }

  # aws_ecs_service.main[0] will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "sample-service"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Application" = "Startup Sample"
        }
      + tags_all                           = {
          + "Application" = "Startup Sample"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }

      + load_balancer {
          + container_name   = "sample-client-app"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
        }
    }

  # aws_ecs_task_definition.app[0] will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "sample-app-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Application" = "Startup Sample"
        }
      + tags_all                 = {
          + "Application" = "Startup Sample"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "startupSampleEcsTaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Application" = "Startup Sample"
        }
      + tags_all              = {
          + "Application" = "Startup Sample"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.sample_app_container_role will be created
  + resource "aws_iam_role" "sample_app_container_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sample_app_container_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Application" = "Startup Sample"
        }
      + tags_all              = {
          + "Application" = "Startup Sample"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.ecs_task_execution_cwlogs will be created
  + resource "aws_iam_role_policy" "ecs_task_execution_cwlogs" {
      + id     = (known after apply)
      + name   = "ecs_task_execution_cwlogs"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.sample_app_container_cwlogs will be created
  + resource "aws_iam_role_policy" "sample_app_container_cwlogs" {
      + id     = (known after apply)
      + name   = "sample_app_container_cwlogs"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.sample_app_dynamodb will be created
  + resource "aws_iam_role_policy" "sample_app_dynamodb" {
      + id     = (known after apply)
      + name   = "sample_app_dynamodb"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy.ssp_bucket_policy will be created
  + resource "aws_iam_role_policy" "ssp_bucket_policy" {
      + id     = (known after apply)
      + name   = "upload_bucket_policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "startupSampleEcsTaskExecutionRole"
    }

  # aws_lb_listener_rule.host_based_weighted_routing will be created
  + resource "aws_lb_listener_rule" "host_based_weighted_routing" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd"
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "startup-sample-project.*",
                ]
            }
        }
    }

  # aws_s3_bucket.upload_bucket will be created
  + resource "aws_s3_bucket" "upload_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "allow inbound access from the ALB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-077ca2fe1ed399078",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "sample-ecs-tasks-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "Startup Sample"
        }
      + tags_all               = {
          + "Application" = "Startup Sample"
        }
      + vpc_id                 = "vpc-018906cab60cf165b"
    }

  # aws_sns_topic.billing_alert_topic will be created
  + resource "aws_sns_topic" "billing_alert_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "startup-sample-billing-alert-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # random_integer.cf_origin_id will be created
  + resource "random_integer" "cf_origin_id" {
      + id     = (known after apply)
      + max    = 100
      + min    = 1
      + result = (known after apply)
    }

  # random_pet.upload_bucket_name will be created
  + resource "random_pet" "upload_bucket_name" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "upload-bucket"
      + separator = "-"
    }

Plan: 26 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_hostname   = "internal-default-1373711485.ca-central-1.elb.amazonaws.com"
  + cloudfront_url = (known after apply)
  + sns_topic      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_caller_identity.current: Reading...%0Amodule.network.data.aws_security_group.web: Reading...%0Adata.aws_alb.main: Reading...%0Amodule.network.data.aws_security_group.data: Reading...%0Adata.aws_security_group.web: Reading...%0Amodule.network.data.aws_security_group.app: Reading...%0Adata.aws_iam_policy_document.ecs_task_execution_role: Reading...%0Amodule.network.data.aws_vpc.main: Reading...%0Adata.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]%0Adata.aws_caller_identity.current: Read complete after 0s [id=813318847992]%0Adata.aws_security_group.web: Read complete after 1s [id=sg-077ca2fe1ed399078]%0Amodule.network.data.aws_security_group.data: Read complete after 1s [id=sg-068812412c1f4bea9]%0Amodule.network.data.aws_security_group.web: Read complete after 1s [id=sg-077ca2fe1ed399078]%0Amodule.network.data.aws_security_group.app: Read complete after 1s [id=sg-03895fdd9a15adf6e]%0Adata.aws_alb.main: Read complete after 1s [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/1551ae1e56885489]%0Adata.aws_alb_listener.front_end: Reading...%0Adata.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd]%0Amodule.network.data.aws_vpc.main: Read complete after 1s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnets.data: Reading...%0Amodule.network.data.aws_subnets.web: Reading...%0Amodule.network.data.aws_subnets.app: Reading...%0Amodule.network.data.aws_subnets.app: Read complete after 0s [id=ca-central-1]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Reading...%0Amodule.network.data.aws_subnets.web: Read complete after 0s [id=ca-central-1]%0Amodule.network.data.aws_subnets.data: Read complete after 0s [id=ca-central-1]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Reading...%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Reading...%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Reading...%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Read complete after 0s [id=subnet-0896ff158c3ecdc53]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Read complete after 0s [id=subnet-048e25be105ae01d3]%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Read complete after 0s [id=subnet-0a663db91e3d61619]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Read complete after 0s [id=subnet-089c577af80110363]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Read complete after 0s [id=subnet-0077fd92d83bfff33]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Read complete after 0s [id=subnet-0d0e52f2aabe9cd5d]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_alb_target_group.app will be created%0A  + resource "aws_alb_target_group" "app" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "30"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "sample-target-group"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                           = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = "vpc-018906cab60cf165b"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 5%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 3%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A    }%0A%0A  # aws_appautoscaling_policy.down[0] will be created%0A  + resource "aws_appautoscaling_policy" "down" {%0A      + alarm_arns         = (known after apply)%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "sample_scale_down"%0A      + policy_type        = "StepScaling"%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + step_scaling_policy_configuration {%0A          + adjustment_type         = "ChangeInCapacity"%0A          + cooldown                = 60%0A          + metric_aggregation_type = "Maximum"%0A%0A          + step_adjustment {%0A              + metric_interval_upper_bound = "0"%0A              + scaling_adjustment          = -1%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_policy.up[0] will be created%0A  + resource "aws_appautoscaling_policy" "up" {%0A      + alarm_arns         = (known after apply)%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "sample_scale_up"%0A      + policy_type        = "StepScaling"%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + step_scaling_policy_configuration {%0A          + adjustment_type         = "ChangeInCapacity"%0A          + cooldown                = 60%0A          + metric_aggregation_type = "Maximum"%0A%0A          + step_adjustment {%0A              + metric_interval_lower_bound = "0"%0A              + scaling_adjustment          = 1%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_target.target[0] will be created%0A  + resource "aws_appautoscaling_target" "target" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + max_capacity       = 6%0A      + min_capacity       = 1%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + role_arn           = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A      + tags_all           = (known after apply)%0A    }%0A%0A  # aws_budgets_budget.cost will be created%0A  + resource "aws_budgets_budget" "cost" {%0A      + account_id        = (known after apply)%0A      + arn               = (known after apply)%0A      + budget_type       = "COST"%0A      + cost_filters      = (known after apply)%0A      + id                = (known after apply)%0A      + limit_amount      = "100.0"%0A      + limit_unit        = "USD"%0A      + name              = "startup-sample-monthly"%0A      + name_prefix       = (known after apply)%0A      + time_period_end   = "2087-06-15_00:00"%0A      + time_period_start = (known after apply)%0A      + time_unit         = "MONTHLY"%0A%0A      + cost_filter {%0A          + name   = "TagKeyValue"%0A          + values = [%0A              + "user:Project$Startup Sample",%0A            ]%0A        }%0A%0A      + cost_types {%0A          + include_credit             = (known after apply)%0A          + include_discount           = (known after apply)%0A          + include_other_subscription = (known after apply)%0A          + include_recurring          = (known after apply)%0A          + include_refund             = (known after apply)%0A          + include_subscription       = (known after apply)%0A          + include_support            = (known after apply)%0A          + include_tax                = (known after apply)%0A          + include_upfront            = (known after apply)%0A          + use_amortized              = (known after apply)%0A          + use_blended                = (known after apply)%0A        }%0A%0A      + notification {%0A          + comparison_operator        = "GREATER_THAN"%0A          + notification_type          = "FORECASTED"%0A          + subscriber_email_addresses = []%0A          + subscriber_sns_topic_arns  = (known after apply)%0A          + threshold                  = 75%0A          + threshold_type             = "PERCENTAGE"%0A        }%0A    }%0A%0A  # aws_cloudfront_distribution.geofencing[0] will be created%0A  + resource "aws_cloudfront_distribution" "geofencing" {%0A      + arn                            = (known after apply)%0A      + caller_reference               = (known after apply)%0A      + comment                        = "geofencing"%0A      + domain_name                    = (known after apply)%0A      + enabled                        = true%0A      + etag                           = (known after apply)%0A      + hosted_zone_id                 = (known after apply)%0A      + http_version                   = "http2"%0A      + id                             = (known after apply)%0A      + in_progress_validation_batches = (known after apply)%0A      + is_ipv6_enabled                = true%0A      + last_modified_time             = (known after apply)%0A      + price_class                    = "PriceClass_100"%0A      + retain_on_delete               = false%0A      + status                         = (known after apply)%0A      + tags                           = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                       = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + trusted_key_groups             = (known after apply)%0A      + trusted_signers                = (known after apply)%0A      + wait_for_deployment            = true%0A%0A      + default_cache_behavior {%0A          + allowed_methods        = [%0A              + "DELETE",%0A              + "GET",%0A              + "HEAD",%0A              + "OPTIONS",%0A              + "PATCH",%0A              + "POST",%0A              + "PUT",%0A            ]%0A          + cached_methods         = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + compress               = false%0A          + default_ttl            = 3600%0A          + max_ttl                = 86400%0A          + min_ttl                = 0%0A          + target_origin_id       = (known after apply)%0A          + trusted_key_groups     = (known after apply)%0A          + trusted_signers        = (known after apply)%0A          + viewer_protocol_policy = "redirect-to-https"%0A%0A          + forwarded_values {%0A              + headers                 = (known after apply)%0A              + query_string            = true%0A              + query_string_cache_keys = (known after apply)%0A%0A              + cookies {%0A                  + forward           = "all"%0A                  + whitelisted_names = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + ordered_cache_behavior {%0A          + allowed_methods        = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + cached_methods         = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + compress               = false%0A          + default_ttl            = 3600%0A          + max_ttl                = 86400%0A          + min_ttl                = 0%0A          + path_pattern           = "/static/*"%0A          + target_origin_id       = (known after apply)%0A          + viewer_protocol_policy = "redirect-to-https"%0A%0A          + forwarded_values {%0A              + headers                 = [%0A                  + "Origin",%0A                ]%0A              + query_string            = false%0A              + query_string_cache_keys = (known after apply)%0A%0A              + cookies {%0A                  + forward = "none"%0A                }%0A            }%0A        }%0A%0A      + origin {%0A          + connection_attempts = 3%0A          + connection_timeout  = 10%0A          + domain_name         = "startup-sample-project.tnfhhm-dev.nimbus.cloud.gov.bc.ca"%0A          + origin_id           = (known after apply)%0A%0A          + custom_origin_config {%0A              + http_port                = 80%0A              + https_port               = 443%0A              + origin_keepalive_timeout = 5%0A              + origin_protocol_policy   = "https-only"%0A              + origin_read_timeout      = 30%0A              + origin_ssl_protocols     = [%0A                  + "TLSv1.2",%0A                ]%0A            }%0A        }%0A%0A      + restrictions {%0A          + geo_restriction {%0A              + locations        = [%0A                  + "CA",%0A                ]%0A              + restriction_type = "whitelist"%0A            }%0A        }%0A%0A      + viewer_certificate {%0A          + cloudfront_default_certificate = true%0A          + minimum_protocol_version       = "TLSv1"%0A        }%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_high[0] will be created%0A  + resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {%0A      + actions_enabled                       = true%0A      + alarm_actions                         = (known after apply)%0A      + alarm_name                            = "sample_cpu_utilization_high"%0A      + arn                                   = (known after apply)%0A      + comparison_operator                   = "GreaterThanOrEqualToThreshold"%0A      + dimensions                            = {%0A          + "ClusterName" = "sample-cluster"%0A          + "ServiceName" = "sample-service"%0A        }%0A      + evaluate_low_sample_count_percentiles = (known after apply)%0A      + evaluation_periods                    = 2%0A      + id                                    = (known after apply)%0A      + metric_name                           = "CPUUtilization"%0A      + namespace                             = "AWS/ECS"%0A      + period                                = 60%0A      + statistic                             = "Average"%0A      + tags                                  = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                              = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + threshold                             = 85%0A      + treat_missing_data                    = "missing"%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_low[0] will be created%0A  + resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {%0A      + actions_enabled                       = true%0A      + alarm_actions                         = (known after apply)%0A      + alarm_name                            = "sample_cpu_utilization_low"%0A      + arn                                   = (known after apply)%0A      + comparison_operator                   = "LessThanOrEqualToThreshold"%0A      + dimensions                            = {%0A          + "ClusterName" = "sample-cluster"%0A          + "ServiceName" = "sample-service"%0A        }%0A      + evaluate_low_sample_count_percentiles = (known after apply)%0A      + evaluation_periods                    = 2%0A      + id                                    = (known after apply)%0A      + metric_name                           = "CPUUtilization"%0A      + namespace                             = "AWS/ECS"%0A      + period                                = 60%0A      + statistic                             = "Average"%0A      + tags                                  = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                              = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + threshold                             = 10%0A      + treat_missing_data                    = "missing"%0A    }%0A%0A  # aws_dynamodb_table.startup_sample_table will be created%0A  + resource "aws_dynamodb_table" "startup_sample_table" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PROVISIONED"%0A      + hash_key         = "pid"%0A      + id               = (known after apply)%0A      + name             = "ssp-greetings"%0A      + range_key        = "createdAt"%0A      + read_capacity    = 1%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all         = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + write_capacity   = 1%0A%0A      + attribute {%0A          + name = "createdAt"%0A          + type = "S"%0A        }%0A      + attribute {%0A          + name = "pid"%0A          + type = "S"%0A        }%0A%0A      + point_in_time_recovery {%0A          + enabled = (known after apply)%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = (known after apply)%0A          + kms_key_arn = (known after apply)%0A        }%0A%0A      + ttl {%0A          + attribute_name = (known after apply)%0A          + enabled        = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_cluster.main will be created%0A  + resource "aws_ecs_cluster" "main" {%0A      + arn                = (known after apply)%0A      + capacity_providers = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "sample-cluster"%0A      + tags               = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all           = {%0A          + "Application" = "Startup Sample"%0A        }%0A%0A      + default_capacity_provider_strategy {%0A          + base              = (known after apply)%0A          + capacity_provider = (known after apply)%0A          + weight            = (known after apply)%0A        }%0A%0A      + setting {%0A          + name  = (known after apply)%0A          + value = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_cluster_capacity_providers.sample will be created%0A  + resource "aws_ecs_cluster_capacity_providers" "sample" {%0A      + capacity_providers = [%0A          + "FARGATE_SPOT",%0A        ]%0A      + cluster_name       = "sample-cluster"%0A      + id                 = (known after apply)%0A%0A      + default_capacity_provider_strategy {%0A          + base              = 0%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 100%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] will be created%0A  + resource "aws_ecs_service" "main" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 2%0A      + enable_ecs_managed_tags            = true%0A      + enable_execute_command             = false%0A      + health_check_grace_period_seconds  = 60%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = (known after apply)%0A      + name                               = "sample-service"%0A      + platform_version                   = (known after apply)%0A      + propagate_tags                     = "TASK_DEFINITION"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                           = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + capacity_provider_strategy {%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 100%0A        }%0A%0A      + load_balancer {%0A          + container_name   = "sample-client-app"%0A          + container_port   = 80%0A          + target_group_arn = (known after apply)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = [%0A              + "subnet-048e25be105ae01d3",%0A              + "subnet-0896ff158c3ecdc53",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] will be created%0A  + resource "aws_ecs_task_definition" "app" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "512"%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "sample-app-task"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                 = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + task_role_arn            = (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_task_execution_role will be created%0A  + resource "aws_iam_role" "ecs_task_execution_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                      + Sid       = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "startupSampleEcsTaskExecutionRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags                  = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all              = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # aws_iam_role.sample_app_container_role will be created%0A  + resource "aws_iam_role" "sample_app_container_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                      + Sid       = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "sample_app_container_role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags                  = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all              = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # aws_iam_role_policy.ecs_task_execution_cwlogs will be created%0A  + resource "aws_iam_role_policy" "ecs_task_execution_cwlogs" {%0A      + id     = (known after apply)%0A      + name   = "ecs_task_execution_cwlogs"%0A      + policy = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:logs:*:*:*",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role   = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.sample_app_container_cwlogs will be created%0A  + resource "aws_iam_role_policy" "sample_app_container_cwlogs" {%0A      + id     = (known after apply)%0A      + name   = "sample_app_container_cwlogs"%0A      + policy = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                          + "logs:CreateLogStream",%0A                          + "logs:PutLogEvents",%0A                          + "logs:DescribeLogStreams",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:logs:*:*:*",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role   = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.sample_app_dynamodb will be created%0A  + resource "aws_iam_role_policy" "sample_app_dynamodb" {%0A      + id     = (known after apply)%0A      + name   = "sample_app_dynamodb"%0A      + policy = (known after apply)%0A      + role   = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.ssp_bucket_policy will be created%0A  + resource "aws_iam_role_policy" "ssp_bucket_policy" {%0A      + id     = (known after apply)%0A      + name   = "upload_bucket_policy"%0A      + policy = (known after apply)%0A      + role   = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_task_execution_role will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = "startupSampleEcsTaskExecutionRole"%0A    }%0A%0A  # aws_lb_listener_rule.host_based_weighted_routing will be created%0A  + resource "aws_lb_listener_rule" "host_based_weighted_routing" {%0A      + arn          = (known after apply)%0A      + id           = (known after apply)%0A      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd"%0A      + priority     = (known after apply)%0A      + tags_all     = (known after apply)%0A%0A      + action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + condition {%0A          + host_header {%0A              + values = [%0A                  + "startup-sample-project.*",%0A                ]%0A            }%0A        }%0A    }%0A%0A  # aws_s3_bucket.upload_bucket will be created%0A  + resource "aws_s3_bucket" "upload_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = (known after apply)%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule {%0A          + allowed_headers = (known after apply)%0A          + allowed_methods = (known after apply)%0A          + allowed_origins = (known after apply)%0A          + expose_headers  = (known after apply)%0A          + max_age_seconds = (known after apply)%0A        }%0A%0A      + grant {%0A          + id          = (known after apply)%0A          + permissions = (known after apply)%0A          + type        = (known after apply)%0A          + uri         = (known after apply)%0A        }%0A%0A      + lifecycle_rule {%0A          + abort_incomplete_multipart_upload_days = (known after apply)%0A          + enabled                                = (known after apply)%0A          + id                                     = (known after apply)%0A          + prefix                                 = (known after apply)%0A          + tags                                   = (known after apply)%0A%0A          + expiration {%0A              + date                         = (known after apply)%0A              + days                         = (known after apply)%0A              + expired_object_delete_marker = (known after apply)%0A            }%0A%0A          + noncurrent_version_expiration {%0A              + days = (known after apply)%0A            }%0A%0A          + noncurrent_version_transition {%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A%0A          + transition {%0A              + date          = (known after apply)%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A        }%0A%0A      + logging {%0A          + target_bucket = (known after apply)%0A          + target_prefix = (known after apply)%0A        }%0A%0A      + object_lock_configuration {%0A          + object_lock_enabled = (known after apply)%0A%0A          + rule {%0A              + default_retention {%0A                  + days  = (known after apply)%0A                  + mode  = (known after apply)%0A                  + years = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + replication_configuration {%0A          + role = (known after apply)%0A%0A          + rules {%0A              + delete_marker_replication_status = (known after apply)%0A              + id                               = (known after apply)%0A              + prefix                           = (known after apply)%0A              + priority                         = (known after apply)%0A              + status                           = (known after apply)%0A%0A              + destination {%0A                  + account_id         = (known after apply)%0A                  + bucket             = (known after apply)%0A                  + replica_kms_key_id = (known after apply)%0A                  + storage_class      = (known after apply)%0A%0A                  + access_control_translation {%0A                      + owner = (known after apply)%0A                    }%0A%0A                  + metrics {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A%0A                  + replication_time {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A                }%0A%0A              + filter {%0A                  + prefix = (known after apply)%0A                  + tags   = (known after apply)%0A                }%0A%0A              + source_selection_criteria {%0A                  + sse_kms_encrypted_objects {%0A                      + enabled = (known after apply)%0A                    }%0A                }%0A            }%0A        }%0A%0A      + server_side_encryption_configuration {%0A          + rule {%0A              + bucket_key_enabled = (known after apply)%0A%0A              + apply_server_side_encryption_by_default {%0A                  + kms_master_key_id = (known after apply)%0A                  + sse_algorithm     = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A%0A      + website {%0A          + error_document           = (known after apply)%0A          + index_document           = (known after apply)%0A          + redirect_all_requests_to = (known after apply)%0A          + routing_rules            = (known after apply)%0A        }%0A    }%0A%0A  # aws_security_group.ecs_tasks will be created%0A  + resource "aws_security_group" "ecs_tasks" {%0A      + arn                    = (known after apply)%0A      + description            = "allow inbound access from the ALB only"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = []%0A              + description      = ""%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = [%0A                  + "sg-077ca2fe1ed399078",%0A                ]%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "sample-ecs-tasks-security-group"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all               = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + vpc_id                 = "vpc-018906cab60cf165b"%0A    }%0A%0A  # aws_sns_topic.billing_alert_topic will be created%0A  + resource "aws_sns_topic" "billing_alert_topic" {%0A      + arn                         = (known after apply)%0A      + content_based_deduplication = false%0A      + fifo_topic                  = false%0A      + id                          = (known after apply)%0A      + name                        = "startup-sample-billing-alert-topic"%0A      + name_prefix                 = (known after apply)%0A      + owner                       = (known after apply)%0A      + policy                      = (known after apply)%0A      + signature_version           = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + tracing_config              = (known after apply)%0A    }%0A%0A  # random_integer.cf_origin_id will be created%0A  + resource "random_integer" "cf_origin_id" {%0A      + id     = (known after apply)%0A      + max    = 100%0A      + min    = 1%0A      + result = (known after apply)%0A    }%0A%0A  # random_pet.upload_bucket_name will be created%0A  + resource "random_pet" "upload_bucket_name" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + prefix    = "upload-bucket"%0A      + separator = "-"%0A    }%0A%0APlan: 26 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + alb_hostname   = "internal-default-1373711485.ca-central-1.elb.amazonaws.com"%0A  + cloudfront_url = (known after apply)%0A  + sns_topic      = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>
#### Architecture Diagram

![img]()
*Pusher:* @prabhukiran9999, *Action:* [Pull Request: #11](https://github.com/prabhukiran9999/startup-sample-project-aws-containers/actions/runs/5314357256)